[
    {
        "season": "Summer",
        "image": "/summer.png",
        "description": "Summer in Bangladesh is intense, with soaring temperatures and high humidity. The heat dominates the air, making it the perfect time for festivals that offer relief and celebrations. People flock to rivers, enjoy tropical fruits, and immerse themselves in vibrant cultural activities. Festivals like the Mango Festival bring people together to appreciate the rich agricultural bounty of the land, while events like the Boishakhi Mela celebrate new beginnings and the essence of Bengali traditions. Summer is a season of resilience, community bonding, and the celebration of nature’s gifts.",
        "events": [
            {
                "id": "mango-festival",
                "name": "Mango Festival",
                "description": {
                    "long": "The Mango Festival is a vibrant celebration dedicated to Bangladesh’s rich mango harvest. It showcases the diversity of mango varieties through tasting sessions, where visitors can savor the unique flavors of local mangoes. The festival includes cooking demonstrations, where chefs exhibit innovative mango-based dishes, and agricultural fairs that highlight the significance of mango farming in rural communities. The festival is a joyful, sensory experience celebrating one of Bangladesh’s most beloved fruits.",
                    "short": "A festival showcasing Bangladesh’s mango varieties with tastings, cooking demos, and agricultural fairs."
                },
                "dateRange": "June to August",
                "image": "/mango-festival.png",
                "avgRating": 4.7
            },
            {
                "id": "boishakhi-mela",
                "name": "Boishakhi Mela",
                "description": {
                    "long": "Boishakhi Mela is a traditional fair celebrating the Bengali New Year, featuring cultural performances like music and dance that reflect the spirit of Bangladesh. Handicraft stalls, traditional games, and food vendors enhance the vibrant atmosphere. It’s a time for people of all ages to gather and celebrate Bengali heritage, creating a sense of community and pride.",
                    "short": "A fair for the Bengali New Year with music, dance, handicrafts, and traditional food."
                },
                "dateRange": "April to May",
                "image": "/boishakhi-mela.png",
                "avgRating": 4.8
            }
        ]
    },
    {
        "season": "Monsoon",
        "image": "/monsoon.png",
        "description": "Monsoon is the most awaited season in Bangladesh, as the rains transform the landscape, nurturing the fields and bringing life to the environment. It’s a time of renewal and growth, with the monsoon rains often symbolizing prosperity. The season is marked by festivals that celebrate the arrival of the rain, such as the Rainy Season Festival. Boat races, a popular event during this time, showcase local craftsmanship and team spirit as communities compete on the water. The monsoon season is a time to celebrate the rhythm of nature, the sounds of rain, and the spirit of the people.",
        "events": [
            {
                "id": "rainy-season-festival",
                "name": "Rainy Season Festival",
                "description": {
                    "long": "The Rainy Season Festival embraces the monsoon rains with lively celebrations, including traditional songs and dances that pay homage to the rain’s life-giving power. Boat races are the main highlight, where villages compete with handcrafted boats, showcasing the skill of local artisans. This festival is a time for communities to unite in the joy of the rainy season.",
                    "short": "Celebrating monsoon rains with songs, dances, and competitive boat races."
                },
                "dateRange": "July to September",
                "image": "/rainy-season-festival.png",
                "avgRating": 4.6
            },
            {
                "id": "boat-race",
                "name": "Boat Race",
                "description": {
                    "long": "During the monsoon, rivers across Bangladesh come alive with spirited boat races. Villages enter their best boats, each intricately designed, to compete in fast-paced races. Spectators line the riverbanks, cheering on teams as they row with synchronized precision. It’s a celebration of community pride, local craftsmanship, and athletic skill.",
                    "short": "A thrilling monsoon event where villages compete in boat races, showcasing skill and community pride."
                },
                "dateRange": "August to September",
                "image": "/boat-race.png",
                "avgRating": 4.9
            }
        ]
    },
    {
        "season": "Autumn",
        "image": "/autumn.png",
        "description": "Autumn in Bangladesh is a transition from the heat of summer to the coolness of winter. The air becomes crisp and refreshing, bringing a sense of calm and clarity. It’s a time for harvest and giving thanks for the bounty of the land. Festivals like Nabanna Utsab are an essential part of this season, celebrating the abundance of the rice harvest with joyous music, dance, and food. Autumn represents the fullness of life’s cycles, offering a time for reflection, thanksgiving, and community connection around nature’s abundance.",
        "events": [
            {
                "id": "nabanna",
                "name": "Nabanna Utsab",
                "description": {
                    "long": "Nabanna Utsab celebrates the autumn rice harvest, a season of gratitude and abundance. People gather to enjoy cultural performances, traditional songs, and dances that honor the hard work of farmers. Food stalls offer dishes made from the new rice, allowing visitors to taste the fresh harvest’s richness. It’s a festival that brings rural and urban communities together in thanksgiving.",
                    "short": "A harvest festival with traditional dance, music, and foods made from fresh rice."
                },
                "dateRange": "October to November",
                "image": "/nabanna-utsab.png",
                "avgRating": 4.8
            }
        ]
    },
    {
        "season": "Late Autumn",
        "image": "/late-autumn.png",
        "description": "Late autumn brings a chill to the air, as the harvest season continues and the temperatures start to drop further. It’s a time for spiritual reflection and connection with nature’s cycles. Festivals like Kartik Puja are celebrated with devotion, as people honor their deities and seek blessings for prosperity. The Agrahayan Festival marks the completion of the rice harvest, and communities gather to celebrate the fruits of their labor. Late autumn in Bangladesh is a season of preparation for the coming winter, with a focus on both spiritual growth and communal celebration.",
        "events": [
            {
                "id": "kartik-puja",
                "name": "Kartik Puja",
                "description": {
                    "long": "Kartik Puja is a sacred Hindu festival dedicated to Lord Kartik, celebrated with deep devotion in late autumn. Devotees perform rituals, sing hymns, and offer flowers and fruits to the deity, seeking blessings for health and prosperity. Cultural performances and processions mark the day, blending religious devotion with festive community spirit.",
                    "short": "A religious festival with rituals, offerings, and cultural performances."
                },
                "dateRange": "November",
                "image": "/kartik-puja.png",
                "avgRating": 4.5
            },
            {
                "id": "agrahayan-festival",
                "name": "Agrahayan Festival",
                "description": {
                    "long": "The Agrahayan Festival marks the end of the rice harvest, celebrating the completion of another farming cycle. Families gather to share meals made from the fresh harvest, and communities organize cultural programs with music and dance. It’s a time for farmers to take pride in their work and for communities to honor the agricultural tradition.",
                    "short": "A festival marking the rice harvest’s end with community meals and celebrations."
                },
                "dateRange": "November to December",
                "image": "/agrahayan-festival.png",
                "avgRating": 4.4
            }
        ]
    },
    {
        "season": "Winter",
        "image": "/winter.png",
        "description": "Winter in Bangladesh is a beloved season, marked by cooler temperatures and clear skies. It is a time for outdoor activities and festivals that center around warmth, community, and culinary delights. Events like Pitha Utsab, which celebrates traditional rice cakes, bring families and communities together to enjoy homemade treats and warm gatherings. The Naboborsho Celebration, which marks the Bengali New Year, brings with it a spirit of renewal, cultural performances, and festive fairs. Winter is a season of joy, togetherness, and the celebration of life’s simple pleasures.",
        "events": [
            {
                "id": "pitha-festival",
                "name": "Pitha Utsab",
                "description": {
                    "long": "Pitha Utsab is a delightful winter festival that celebrates traditional Bangladeshi rice cakes, known as “pithas.” Families and vendors showcase various types, each with unique fillings and flavors. The festival is a cozy winter tradition where communities come together to enjoy sweet and savory treats, celebrating Bangladesh’s culinary heritage.",
                    "short": "A festival for traditional rice cakes, bringing families together to enjoy winter treats."
                },
                "dateRange": "December to February",
                "image": "/pitha-utsab.png",
                "avgRating": 4.9
            },
            {
                "id": "naboborsho",
                "name": "Naboborsho Celebration",
                "description": {
                    "long": "The Naboborsho Celebration welcomes the Bengali New Year with cultural performances, traditional music, and lively fairs. Communities gather to enjoy street food, handicraft stalls, and theatrical performances, marking the start of the new year with hope and joy. It’s a celebration of culture, tradition, and community spirit.",
                    "short": "A New Year celebration with music, dance, and fairs, fostering community and cultural pride."
                },
                "dateRange": "January",
                "image": "/naboborsho-celebration.png",
                "avgRating": 4.6
            }
        ]
    },
    {
        "season": "Spring",
        "image": "/spring.png",
        "description": "Spring is a season of rebirth and renewal, when flowers bloom, the air becomes fresher, and nature seems to come alive again. The first day of spring, celebrated as Pohela Falgun, marks a cultural resurgence with vibrant clothing, music, and dance. People celebrate the arrival of warmer weather and the end of the chill. Valentine’s Day, also celebrated in spring, marks a time for love and togetherness, with gifts, flowers, and special gatherings. Spring is a season of energy, color, and optimism, a reminder of the beauty of change and the joy of new beginnings.",
        "events": [
            {
                "id": "pohela-falgun",
                "name": "Pohela Falgun",
                "description": {
                    "long": "Pohela Falgun, the first day of spring, is celebrated with vibrant clothing, flowers, and joyous performances. People adorn themselves in colorful attire, and streets come alive with music and dance, symbolizing the rejuvenation of nature. The day marks a cultural revival, inspiring hope and the beauty of renewal.",
                    "short": "A spring festival celebrating renewal with flowers, colorful attire, and cultural performances."
                },
                "dateRange": "February",
                "image": "/pohela-falgun.png",
                "avgRating": 5.0
            },
            {
                "id": "valentine-day",
                "name": "Valentine's Day",
                "description": {
                    "long": "Valentine's Day in urban Bangladesh is celebrated with gifts, flowers, and gatherings. Couples and friends express their affection with thoughtful gestures, while public spaces host themed events. It’s a day of warmth, bonding, and appreciation for loved ones.",
                    "short": "A day of love and appreciation with gifts, flowers, and gatherings among friends and loved ones."
                },
                "dateRange": "February 14",
                "image": "/valentines-day.png",
                "avgRating": 4.3
            }
        ]
    }
]